Revit 2020 API
CanExecuteEventArgs Properties
The CanExecuteEventArgs type exposes the following members.
Properties
Name | Description
ActiveDocument
 The active document.
 (Inherited from CommandEventArgs.)
Cancel
 Indicates whether the event is being cancelled. When the event is cancellable, set the property to True to cancel it.
 (Inherited from RevitEventArgs.)
Cancellable
 Indicates whether an event may be cancelled by an event delegate.
 (Inherited from RevitEventArgs.)
CanExecute
The value that indicates whether the Command associated with this event can be executed.
CommandId
 The command id.
 (Inherited from CommandEventArgs.)
See Also
CanExecuteEventArgs Class
Autodesk.Revit.UI.Events Namespace